# --- TRÍADES MAIORES (CAGED) ---
# Ordem das listas: [7ª, 6ª, 5ª, 4ª, 3ª, 2ª, 1ª]

TRIADE_C_MAIOR = [
    [0, 1, 0, 0], # 7ª B -> C (1)
    [1, 0, 0, 1], # 6ª E -> E (0), G (3)
    [0, 0, 0, 1], # 5ª A -> C (3)
    [0, 0, 1, 0], # 4ª D -> E (2)
    [1, 0, 0, 0], # 3ª G -> G (0)
    [0, 1, 0, 0], # 2ª B -> C (1)
    [1, 0, 0, 1]  # 1ª E -> E (0), G (3)
]

TRIADE_A_MAIOR = [
    [0, 0, 1, 0, 0], # 7ª B -> C# (2)
    [1, 0, 0, 0, 0], # 6ª E -> E (0)
    [1, 0, 0, 0, 1], # 5ª A -> A (0), C# (4)
    [0, 0, 1, 0, 0], # 4ª D -> E (2)
    [0, 0, 1, 0, 0], # 3ª G -> A (2)
    [0, 0, 1, 0, 0], # 2ª B -> C# (2)
    [1, 0, 0, 0, 0]  # 1ª E -> E (0)
]

TRIADE_G_MAIOR = [
    [1, 0, 0, 1], # 7ª B -> B (0), D (3)
    [0, 0, 0, 1], # 6ª E -> G (3)
    [0, 0, 1, 0], # 5ª A -> B (2)
    [1, 0, 0, 0], # 4ª D -> D (0)
    [1, 0, 0, 0], # 3ª G -> G (0)
    [1, 0, 0, 1], # 2ª B -> B (0), D (3)
    [0, 0, 0, 1]  # 1ª E -> G (3)
]

TRIADE_E_MAIOR = [
    [1, 0, 0, 0, 0], # 7ª B
    [2, 0, 0, 0, 1], # 6ª E (Tônica na casa 0) -> Troquei o 1 pelo 2
    [0, 0, 1, 0, 0], # 5ª A
    [0, 0, 2, 0, 0], # 4ª D (Tônica na oitava) -> Troquei o 1 pelo 2
    [0, 1, 0, 0, 0], # 3ª G
    [1, 0, 0, 0, 0], # 2ª B
    [2, 0, 0, 0, 1]  # 1ª E (Tônica) -> Troquei o 1 pelo 2
]

TRIADE_D_MAIOR = [
    [0, 0, 0, 1], # 7ª B -> D (3)
    [0, 0, 1, 0], # 6ª E -> F# (2)
    [1, 0, 0, 0], # 5ª A -> A (0)
    [1, 0, 0, 0], # 4ª D -> D (0)
    [0, 0, 1, 0], # 3ª G -> A (2)
    [0, 0, 0, 1], # 2ª B -> D (3)
    [0, 0, 1, 0]  # 1ª E -> F# (2)
]

# --- TRÍADES MENORES (CAGED) ---

TRIADE_C_MENOR = [
    [0, 1, 0, 0, 0], # 7ª B -> C (1)
    [0, 0, 0, 1, 0], # 6ª E -> G (3)
    [0, 0, 0, 1, 0], # 5ª A -> C (3)
    [0, 1, 0, 0, 0], # 4ª D -> Eb (1)
    [1, 0, 0, 0, 0], # 3ª G -> G (0)
    [0, 1, 0, 0, 1], # 2ª B -> C (1), Eb (4)
    [0, 0, 0, 1, 0]  # 1ª E -> G (3)
]

TRIADE_A_MENOR = [
    [0, 1, 0, 0], # 7ª B -> C (1)
    [1, 0, 0, 0], # 6ª E -> E (0)
    [1, 0, 0, 1], # 5ª A -> A (0), C (3)
    [0, 0, 1, 0], # 4ª D -> E (2)
    [0, 0, 1, 0], # 3ª G -> A (2)
    [0, 1, 0, 0], # 2ª B -> C (1)
    [1, 0, 0, 0]  # 1ª E -> E (0)
]

TRIADE_G_MENOR = [
    [0, 0, 0, 1], # 7ª B -> D (3)
    [0, 0, 0, 1], # 6ª E -> G (3)
    [0, 1, 0, 0], # 5ª A -> Bb (1)
    [1, 0, 0, 0], # 4ª D -> D (0)
    [1, 0, 0, 1], # 3ª G -> G (0), Bb (3)
    [0, 0, 0, 1], # 2ª B -> D (3)
    [0, 0, 0, 1]  # 1ª E -> G (3)
]

TRIADE_E_MENOR = [
    [1, 0, 0, 0], # 7ª B -> B (0)
    [1, 0, 0, 1], # 6ª E -> E (0), G (3)
    [0, 0, 1, 0], # 5ª A -> B (2)
    [0, 0, 1, 0], # 4ª D -> E (2)
    [1, 0, 0, 0], # 3ª G -> G (0)
    [1, 0, 0, 0], # 2ª B -> B (0)
    [1, 0, 0, 1]  # 1ª E -> E (0), G (3)
]

TRIADE_D_MENOR = [
    [0, 0, 0, 1], # 7ª B -> D (3)
    [0, 1, 0, 0], # 6ª E -> F (1)
    [1, 0, 0, 0], # 5ª A -> A (0)
    [1, 0, 0, 1], # 4ª D -> D (0), F (3)
    [0, 0, 1, 0], # 3ª G -> A (2)
    [0, 0, 0, 1], # 2ª B -> D (3)
    [0, 1, 0, 0]  # 1ª E -> F (1)
]

# Organização para o carregador
TODOS_AS_TRIADES_MAIORES = [TRIADE_C_MAIOR, TRIADE_A_MAIOR, TRIADE_G_MAIOR, TRIADE_E_MAIOR, TRIADE_D_MAIOR]
TODOS_AS_TRIADES_MENORES = [TRIADE_C_MENOR, TRIADE_A_MENOR, TRIADE_G_MENOR, TRIADE_E_MENOR, TRIADE_D_MENOR]